In [1]:
import pandas as pd

Check the current directory

In [2]:
pwd

'/Users/amodpathirana/ML Tensorflow/Tensorflow-Basics/Pandas'

List the files and folders of the current directory

In [4]:
ls

Pandas Crash Course .ipynb  salaries.csv

In [5]:
df=pd.read_csv('salaries.csv')
df.shape

(3, 3)

In [6]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [18]:
df.as_matrix()

AttributeError: 'DataFrame' object has no attribute 'as_matrix'

Get a spesific column

In [7]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

Get multiple columns

In [10]:
df[['Name',"Age" ]]

     Name  Age
0    John   34
1   Sally   45
2  Alyssa   27

Get spesifc values of numerical columns

Works with numerical columns

In [11]:
df['Age'].max()

45

In [12]:
df['Salary'].mean()

83333.33333333333

Get full descriptive view of the numerical columns

In [15]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

Create customerize filter

In [17]:
my_filter = df["Salary"]>90000
df[my_filter]

    Name  Salary  Age
1  Sally  120000   45